"""
Напишите программу, которая принимает произвольное количество строк и определяет, какие из них представляют собой
корректные географические координаты.
"""

import sys


def is_valid_coordinate(x, y):
    return -90 <= float(x) <= 90 and -180 <= float(y) <= 180


for line in sys.stdin:
    x, y = line.strip()[1:-1].split(', ')
    print(is_valid_coordinate(x, y))

# (0, 0)
# (0.0, 0.0)
# (1.1, 1.1)
# (-43.33333333333333, -64.534895834579)
# (43.33333333333333, 64.534895834579)
# (11, 111)
